<?php $title_name = "Введение"?>
<?php require($_SERVER[DOCUMENT_ROOT]."/core/header.php");?>

<main class="main_head">
    <div class="div_head">Добро пожаловать в PHP</div>
    <div class="div_main">
        PHP: Hypertext Preprocessor (Препроцессор Гипертекста) (<b>PHP</b>) это бесплатный, очень популярный, спенарный язык с открытым кодом. PHP скрипты выполняются на <b>сервере</b>.<br>
        Краткий список того, на что способен PHP:
        <ul>
            <li>&#9866; Создание динамического контента страницы;</li>
            <li>&#9866; создание, открытие, чтение, запись, удаление и закрытие файлов данных;</li>
            <li>&#9866; формы сбора данных;</li>
            <li>&#9866; добавление, удаление и модифицирование информации, хранящейся в вашей базе данных;</li>
            <li>&#9866; шифрование данных;</li>
            <li>&#9866; и многое другое.</li>
        </ul>
        До начала изучения вам необходимо иметь понимание основ HTML.
    </div>
    <div class="div_logo">&#9745;</div>
    <div class="div_fix_main">PHP является достаточно мощным для работы в ядре WordPress, одной из наиболее используемых систем для ведения блога в интернете. Также, имеет степень глубины, необходимую для запуска Facebook, самой большой социальной сети в интеренете</div>
    <div class="div_head" id="head_2">Почему PHP</div>
    <div class="div_main">PHP <b>запускается</b> на множестве различных платформах, включая Windows, Linux, Unix, Mac OS X, и т.д.<br>
    PHP <b>совместим</b> практически с любым современным сервером, таким как Apache, IIS, и другими.<br>
    PHP <b>поддерживает</b> широкий диапазон баз данных.<br>
    PHP является <b>бесплатным</b>!</div>
    <div class="div_logo">&#9745;</div>
    <div class="div_fix_main">PHP является легким для изучения и запускается эффективно на стороне сервера.</div>
</main>

<?php require($_SERVER[DOCUMENT_ROOT]."/core/footer.php");?>
